esmColumnname = ['체크', '아이디', '발송일자', '배송상태', '주문번호', '구매자명', '구매자ID', '수령인명', '택배사명', '송장번호', '배송완료일자', '상품번호',
               '상품명', '수량', '주문옵션', '추가구성', '사은품', '사은품 관리코드', '덤', '덤 관리코드', '판매단가', '판매금액', '판매자 관리코드', '판매자 상세관리코드'
    , '구매자 휴대폰', '구매자 전화번호', '수령인 휴대폰', '수령인 전화번호', '우편번호', '주소', '배송시 요구사항', '배송구분', '배송비', '배송비 금액',
               '배송번호', '배송지연사유', 'SKU번호 및 수량', '수령인 통관정보', '상품미수령신고일자', '상품미수령신고사유', '상품미수령상세사유', '상품미수령철회요청일자',
               '상품미수령이의제기일자', '재배송택배사명', '재배송지 운송장번호', '재배송지 우편번호', '재배송지 주소', '판매방식', '주문종류', '장바구니번호(결제번호)',
               '결제완료일', '주문일자(결제확인전)', '주문확인일자', '발송예정일', '정산예정금액', '서비스 이용료', '판매자쿠폰할인', '구매쿠폰적용금액', '(옥션)우수회원할인',
               '복수구매할인', '스마일캐시적립', '제휴사명']