esmColumnname = ['체크', '아이디', '발송일자', '배송상태', '주문번호', '구매자명', '구매자ID', '수령인명', '택배사명', '송장번호', '배송완료일자', '상품번호',
               '상품명', '수량', '주문옵션', '추가구성', '사은품', '사은품 관리코드', '덤', '덤 관리코드', '판매단가', '판매금액', '판매자 관리코드', '판매자 상세관리코드'
    , '구매자 휴대폰', '구매자 전화번호', '수령인 휴대폰', '수령인 전화번호', '우편번호', '주소', '배송시 요구사항', '배송구분', '배송비', '배송비 금액',
               '배송번호', '배송지연사유', 'SKU번호 및 수량', '수령인 통관정보', '상품미수령신고일자', '상품미수령신고사유', '상품미수령상세사유', '상품미수령철회요청일자',
               '상품미수령이의제기일자', '재배송택배사명', '재배송지 운송장번호', '재배송지 우편번호', '재배송지 주소', '판매방식', '주문종류', '장바구니번호(결제번호)',
               '결제완료일', '주문일자(결제확인전)', '주문확인일자', '발송예정일', '정산예정금액', '서비스 이용료', '판매자쿠폰할인', '구매쿠폰적용금액', '(옥션)우수회원할인',
               '복수구매할인', '스마일캐시적립', '제휴사명']

coupangColumnname =['주문번호','분리배송','택배사','운송장번호','출고예정일','등록상품명/옵션/수량','수취인/연락처','배송지','배송상태','주문일시','묶음배송번호','주문자명','배송지연안내	','접수']

interparkColumnname = [
    '주문번호', '주문순번','상태','삼풍유형','상품번호','상품명','옵션명','수량',
    '택배사','송장번호','발송예정일','배송속성','당일발송여부','배송비결제','배송비','판매단가',
    '판매자부담할인금액','주문금액','구매자ID','수령자명','수령자전화','수령자휴대폰번호',
    '우편번호','주소','배송메시지','판매자상품번호','수수료합산금액','정산예정금액','주문일',
    '결제일','주문확인일','옵션상품번호','판매자옵션상품번호','제조자','구매자명','구매자전화',
    '구매자휴대폰번호','판매자즉시할인액','할인쿠폰(인터파크)','할인쿠폰(CRM)','할인쿠폰(업체)',
    '포인트즉시할인(상품)','판매수술(예상)','I-Point설정수수료','특반여부','결제수단','취소요청수량',
    '발송예정일 변경여부','영수증번호','영문명','개인통관정보'
]

tmonColumnname = [
    '배송번호','딜번호','주문번호','택배사','운송장번호','발송예정일','출고마감일',
    '지연발송예정일','지연사유','지연사유상세','발송지연최종 안내일','운송장등록시점',
    '상품관리코드','주문자명','아이디','주문자연락처','딜명','옵션명','옵션가','구매수량',
    '총 주문금액','결제완료일','추가문구','수취인명','개인통관고유부호','수취인연락처',
    '수취인주소','수취인우편번호','배송요청메모','배송상태','출고일','배송완료일',
    '파트너 Code1','파트너 Code2','파트너 Code3','파트너 Code4','파트너 Code5',
    '추가송장','옵션번호','배송권역구분','도서산간배송비','도서산간선결제','배송비조건',
    '고객부담배송비','배송유형','주문시배송방법'
]



























